##Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
print('введите день недели от 1 до 7')
c = int (input())
if c > 5:
  print ('выходной')
else:
  print ('рабочий') 