##Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

#Пример:

#- x=34; y=-30 -> 4
#- x=2; y=4-> 1
#- x=-34; y=-30 -> 3

print('введите координаты Х и Y через пробел')
c = input().split()


x = int(c[0]) 
y = int(c[1]) 


if x == 0 or y == 0:
  print ('некорректный ввод')  
elif x > 0 and y > 0 :
  print ('1 четверть')
elif x > 0 and y < 0 :
  print ('2 четверть') 
elif x < 0 and y < 0 :
  print ('3 четверть') 
else :
  print ('4 четверть')